[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:50:33
           id="title"
           type="text"
           isInvalid={Boolean(errors.title)}
-          {...register("title", {
-            required: "Title is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
-          })}
+          {...register("title", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
