[Killed] BooleanLiteral
main/pages/Articles/ArticleCreatePage.jsx:9:57
 
 //const addZ = (string) => `${string}Z`;
 
-export default function ArticleCreatePage({ storybook = false }) {
+export default function ArticleCreatePage({ storybook = true }) {
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
killedBy: ArticleCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ { to: '/articles' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/Articles/ArticleCreatePage.jsx:10:31
 //const addZ = (string) => `${string}Z`;
 
 export default function ArticleCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      email: article.email,
-      explanation: article.explanation,
-      localDateTime: article.localDateTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticleCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Articles/ArticleCreatePage.jsx:10:45
 //const addZ = (string) => `${string}Z`;
 
 export default function ArticleCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      email: article.email,
-      explanation: article.explanation,
-      localDateTime: article.localDateTime,
-    },
-  });
+  const objectToAxiosParams = (article) => ({});
 
   const onSuccess = (article) => {
killedBy: ArticleCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
