[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:10:7
 export default function UCSBOrganizationEditPage({ storybook = false }) {
   const { orgCode: orgCodeParam, id: legacyIdParam } = useParams();
   const orgCode = orgCodeParam ?? legacyIdParam;
-  if (!orgCode) {
+  if (true) {
     toast("Missing route param: orgCode (or id). Check your route path.");
     return <Navigate to="/ucsborganization" />;
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:10:17
 export default function UCSBOrganizationEditPage({ storybook = false }) {
   const { orgCode: orgCodeParam, id: legacyIdParam } = useParams();
   const orgCode = orgCodeParam ?? legacyIdParam;
-  if (!orgCode) {
-    toast("Missing route param: orgCode (or id). Check your route path.");
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (!orgCode) {}
   // GET the record by orgCode
   const { data: ucsbOrganization } = useBackend(
killedBy: UCSBOrganizationEditPage when route param missing → toast + Navigate
statusReason: expected "spy" to be called with arguments: [ StringMatching{…} ]

Received: 

  1st spy call:

  [
-   StringMatching /Missing route param: orgCode/,

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:17:5
   // GET the record by orgCode
   const { data: ucsbOrganization } = useBackend(
     [`/api/ucsborganizations?orgCode=${orgCode}`],
-    {
-      method: "GET",
-      url: "/api/ucsborganizations",
-      params: { orgCode },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:29:11
     url: "/api/ucsborganizations",
     method: "PUT",
     params: { orgCode },
-    data: {
-      orgTranslationShort: form.orgTranslationShort,
-      orgTranslation: form.orgTranslation,
-      inactive: form.inactive,
-    },
+    data: {},
   });
   const onSuccess = (updated) => {
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected {} to deeply equal { …(3) }

[Killed] ArrayDeclaration
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:39:78
     toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
   };
 
-  const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
-    `/api/ucsborganizations?orgCode=${orgCode}`,
-  ]);
+  const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, []);
 
   const onSubmit = (data) => mutation.mutate(data);
killedBy: UCSBOrganizationEditPage verifies correct GET method and invalidation key
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:40:5
   };
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
-    `/api/ucsborganizations?orgCode=${orgCode}`,
+    ``,
   ]);
 
killedBy: UCSBOrganizationEditPage verifies correct GET method and invalidation key
statusReason: expected [ '' ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:45:29
 
   const onSubmit = (data) => mutation.mutate(data);
 
-  if (mutation.isSuccess && !storybook) {
+  if (mutation.isSuccess && storybook) {
     return <Navigate to="/ucsborganization" />;
   }
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected "spy" to be called with arguments: [ { to: '/ucsborganization' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
