[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:70:31
           id="url"
           type="text"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
-            required: "URL is required.",
-          })}
+          {...register("url", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /URL is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:114:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="localDateTime">Date (iso format)</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-localDateTime"}
+          data-testid={testIdPrefix + ""}
           id="localDateTime"
           type="datetime-local"
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element by: [data-testid="ArticleForm-localDateTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
