[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:49:20
     },
     {
       header: "Team ID",
-      accessorKey: "teamId",
+      accessorKey: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:63:5
       header: "Explanation",
       accessorKey: "explanation",
     },
-    {
-      header: "Solved",
-      accessorKey: "solved",
-    },
+    {},
   ];
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:64:15
       accessorKey: "explanation",
     },
     {
-      header: "Solved",
+      header: "",
       accessorKey: "solved",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Solved. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
