[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewForm.jsx:35:30
 
   const testIdPrefix = "MenuItemReviewForm";
 
-  const onSubmit = (data) => {
-    const submissionData = {
-      ...data,
-      dateReviewed: data.dateReviewed + ":00",
-    };
-    submitAction(submissionData);
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: MenuItemReviewForm tests calls submitAction with properly formatted data on submit
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:38:41
   const onSubmit = (data) => {
     const submissionData = {
       ...data,
-      dateReviewed: data.dateReviewed + ":00",
+      dateReviewed: data.dateReviewed + "",
     };
     submitAction(submissionData);
killedBy: MenuItemReviewForm tests calls submitAction with properly formatted data on submit
statusReason: expected "spy" to be called with arguments: [ { itemId: '5', …(4) } ]

Received: 

  1st spy call:

  [
    {

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.jsx:45:8
 
   return (
     <Form onSubmit={handleSubmit(onSubmit)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:45:8
 
   return (
     <Form onSubmit={handleSubmit(onSubmit)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:66:34
           id="itemId"
           type="number"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: "Item ID is required.",
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:82:41
           id="reviewerEmail"
           type="text"
           isInvalid={Boolean(errors.reviewerEmail)}
-          {...register("reviewerEmail", {
-            required: "Reviewer Email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("reviewerEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:120:40
           id="dateReviewed"
           type="datetime-local"
           isInvalid={Boolean(errors.dateReviewed)}
-          {...register("dateReviewed", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateReviewed", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date reviewed \(iso format\) is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:121:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateReviewed)}
           {...register("dateReviewed", {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date reviewed \(iso format\) is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:126:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateReviewed && "Date reviewed (iso format) is required."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date reviewed \(iso format\) is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:126:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateReviewed && "Date reviewed (iso format) is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date reviewed \(iso format\) is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:137:36
           id="comments"
           type="text"
           isInvalid={Boolean(errors.comments)}
-          {...register("comments", {
-            required: "Comment is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("comments", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Comment is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
