[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: RecommendationRequestForm tests renders correctly with initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:50:46
               id="requesterEmail"
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required",
-                /* Stryker disable next-line all */
-                pattern: {
-                  /* Stryker disable next-line all */
-                  value: email_regex,
-                  /* Stryker disable next-line all */
-                  message: 'Email should contain one "@" and one "."',
-                },
-                maxLength: {
-                  value: 255,
-                  message: "Max length 255 characters",
-                },
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests validates required fields
statusReason: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:88:28
                   /* Stryker disable next-line all */
                   message: 'Email should contain one "@" and one "."',
                 },
-                maxLength: {
-                  value: 255,
-                  message: "Max length 255 characters",
-                },
+                maxLength: {},
               })}
             />
killedBy: RecommendationRequestForm tests shows max length validation message for professorEmail
statusReason: Unable to find an element with the text: Max length 255 characters. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
