[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:51:5
       header: "Explanation",
       accessorKey: "explanation",
     },
-    {
-      header: "Date Requested",
-      accessorKey: "dateRequested",
-    },
+    {},
     {
       header: "Date Needed",
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:65:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable")
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable")
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:70:20
       ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable")
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable")
+      ButtonColumn("", "danger", deleteCallback, "RecommendationRequestTable")
     );
   }
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
