[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:51:51
               id="dining_commons_code"
               type="text"
               isInvalid={Boolean(errors.dining_commons_code)}
-              {...register("dining_commons_code", {
-                required: "Dining Commons Code is required.",
-              })}
+              {...register("dining_commons_code", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:56:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dining_commons_code?.message}
+              {errors.dining_commons_code.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:91:39
               id="station"
               type="text"
               isInvalid={Boolean(errors.station)}
-              {...register("station", {
-                required: "Station is required.",
-              })}
+              {...register("station", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
