[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBDiningCommonsMenuItem/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/UCSBDiningCommonsMenuItem/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:43:15
       accessorKey: "id", // accessor is the "key" in the data
     },
     {
-      header: "Dining Commons Code",
+      header: "",
       accessorKey: "dining_commons_code",
     },
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Dining Commons Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:44:20
     },
     {
       header: "Dining Commons Code",
-      accessorKey: "dining_commons_code",
+      accessorKey: "",
     },
     {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-dining_commons_code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"
