[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:38:39
               placeholder="e.g., SKY"
               isInvalid={Boolean(errors.orgCode)}
               disabled={Boolean(initialContents)}
-              {...register("orgCode", {
-                required: true,
-                pattern: orgCodeRegex,
-              })}
+              {...register("orgCode", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:39:27
               isInvalid={Boolean(errors.orgCode)}
               disabled={Boolean(initialContents)}
               {...register("orgCode", {
-                required: true,
+                required: false,
                 pattern: orgCodeRegex,
               })}
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:44:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgCode && "Code is required. "}
+              {true}
               {errors.orgCode?.type === "pattern" &&
                 "Code must be 2–10 uppercase letters/numbers (e.g.,SKY, ZPR)."}
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:44:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgCode && "Code is required. "}
+              {errors.orgCode || "Code is required. "}
               {errors.orgCode?.type === "pattern" &&
                 "Code must be 2–10 uppercase letters/numbers (e.g.,SKY, ZPR)."}
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:45:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.orgCode && "Code is required. "}
-              {errors.orgCode?.type === "pattern" &&
+              {errors.orgCode?.type !== "pattern" &&
                 "Code must be 2–10 uppercase letters/numbers (e.g.,SKY, ZPR)."}
             </Form.Control.Feedback>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:45:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.orgCode && "Code is required. "}
-              {errors.orgCode?.type === "pattern" &&
-                "Code must be 2–10 uppercase letters/numbers (e.g.,SKY, ZPR)."}
+              {errors.orgCode?.type === "pattern" || "Code must be 2–10 uppercase letters/numbers (e.g.,SKY, ZPR)."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Code is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:61:27
               placeholder="e.g., SKYDIVING CLUB"
               isInvalid={Boolean(errors.orgTranslationShort)}
               {...register("orgTranslationShort", {
-                required: true,
+                required: false,
               })}
             />
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Short name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:65:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgTranslationShort && "Short name is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Short name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:65:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgTranslationShort && "Short name is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Short name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:80:27
               placeholder="e.g., SKYDIVING CLUB AT UCSB"
               isInvalid={Boolean(errors.orgTranslation)}
               {...register("orgTranslation", {
-                required: true,
+                required: false,
               })}
             />
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Full name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgTranslation && "Full name is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Full name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.orgTranslation && "Full name is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBOrganizationForm required validations prevent submit (create)
statusReason: Unable to find an element with the text: Full name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:98:28
               id="inactive"
               label="Inactive"
               data-testid="UCSBOrganizationForm-inactive"
-              {...register("inactive")}
+              {...register("")}
             />
           </Form.Group>
killedBy: UCSBOrganizationForm renders create form: orgCode visible, id hidden, button says Create
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:117:22
             data-testid="UCSBOrganizationForm-cancel"
             variant="secondary"
             type="button"
-            onClick={() => navigate(-1)}
+            onClick={() => undefined}
           >
             Cancel
killedBy: UCSBOrganizationForm cancel button navigates back
statusReason: expected "spy" to be called with arguments: [ -1 ]

Number of calls: 0

[Killed] UnaryOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:117:37
             data-testid="UCSBOrganizationForm-cancel"
             variant="secondary"
             type="button"
-            onClick={() => navigate(-1)}
+            onClick={() => navigate(+1)}
           >
             Cancel
killedBy: UCSBOrganizationForm cancel button navigates back
statusReason: expected "spy" to be called with arguments: [ -1 ]

Received: 

  1st spy call:

  [
-   -1,
