[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:13:34
 
 export default function UCSBOrganizationTable({ organizations, currentUser }) {
   const navigate = useNavigate();
-  const editCallback = (cell) => {
-    const orgCode = cell.row.original.orgCode;
-    navigate(`/ucsborganization/edit/${orgCode}`);
-  };
+  const editCallback = (cell) => {};
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
killedBy: UCSBOrganizationTable tests Edit button navigates to /ucsborganization/edit/{orgCode}
statusReason: expected "spy" to be called with arguments: [ '/ucsborganization/edit/OSLI' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:23:26
     ["/api/ucsborganizations/all"],
   );
 
-  const deleteCallback = (cell) => deleteMutation.mutate(cell);
+  const deleteCallback = () => undefined;
 
   const columns = [
killedBy: UCSBOrganizationTable tests delete mutation is wired correctly and clicking Delete calls mutate with cell
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrayDeclaration
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:25:19
 
   const deleteCallback = (cell) => deleteMutation.mutate(cell);
 
-  const columns = [
-    { header: "Code", accessorKey: "orgCode" },
-    { header: "Short Name", accessorKey: "orgTranslationShort" },
-    { header: "Full Name", accessorKey: "orgTranslation" },
-    { header: "Inactive?", accessorKey: "inactive" },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationTable tests renders correct headers for ordinary user (no admin buttons)
statusReason: Unable to find an element with the text: Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:27:15
 
   const columns = [
     { header: "Code", accessorKey: "orgCode" },
-    { header: "Short Name", accessorKey: "orgTranslationShort" },
+    { header: "", accessorKey: "orgTranslationShort" },
     { header: "Full Name", accessorKey: "orgTranslation" },
     { header: "Inactive?", accessorKey: "inactive" },
killedBy: UCSBOrganizationTable tests renders correct headers for ordinary user (no admin buttons)
statusReason: Unable to find an element with the text: Short Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:28:41
   const columns = [
     { header: "Code", accessorKey: "orgCode" },
     { header: "Short Name", accessorKey: "orgTranslationShort" },
-    { header: "Full Name", accessorKey: "orgTranslation" },
+    { header: "Full Name", accessorKey: "" },
     { header: "Inactive?", accessorKey: "inactive" },
   ];
killedBy: UCSBOrganizationTable tests columns use the correct accessor keys (cells show real data)
statusReason: Unable to find an element with the text: OFFICE OF STUDENT LIFE. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:28:15
   const columns = [
     { header: "Code", accessorKey: "orgCode" },
     { header: "Short Name", accessorKey: "orgTranslationShort" },
-    { header: "Full Name", accessorKey: "orgTranslation" },
+    { header: "", accessorKey: "orgTranslation" },
     { header: "Inactive?", accessorKey: "inactive" },
   ];
killedBy: UCSBOrganizationTable tests renders correct headers for ordinary user (no admin buttons)
statusReason: Unable to find an element with the text: Full Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:29:41
     { header: "Code", accessorKey: "orgCode" },
     { header: "Short Name", accessorKey: "orgTranslationShort" },
     { header: "Full Name", accessorKey: "orgTranslation" },
-    { header: "Inactive?", accessorKey: "inactive" },
+    { header: "Inactive?", accessorKey: "" },
   ];
 
killedBy: UCSBOrganizationTable tests columns use the correct accessor keys (cells show real data)
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:29:15
     { header: "Code", accessorKey: "orgCode" },
     { header: "Short Name", accessorKey: "orgTranslationShort" },
     { header: "Full Name", accessorKey: "orgTranslation" },
-    { header: "Inactive?", accessorKey: "inactive" },
+    { header: "", accessorKey: "inactive" },
   ];
 
killedBy: UCSBOrganizationTable tests renders correct headers for ordinary user (no admin buttons)
statusReason: Unable to find an element with the text: Inactive?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:37:56
       ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UCSBOrganizationTable tests renders Edit/Delete buttons for admin user with correct Bootstrap variants
statusReason: Unable to find an element by: [data-testid="/UCSBOrganizationTable-cell-row-\d+-col-Delete-button/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
