[Killed] BooleanLiteral
main/pages/Articles/ArticleEditPage.jsx:8:55
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function ArticleEditPage({ storybook = false }) {
+export default function ArticleEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ { to: '/articles' } ]

Number of calls: 0

[Killed] StringLiteral
main/pages/Articles/ArticleEditPage.jsx:22:12
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
 
       method: "GET",
-      url: `/api/articles`,
+      url: ``,
       params: { id },
     },
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Articles/ArticleEditPage.jsx:28:34
   );
 
   // ✅ FIXED: use the correct article fields, including localDateTime
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: { id: article.id },
-    data: {
-      title: article.title,
-      url: article.url,
-      email: article.email,
-      explanation: article.explanation,
-      localDateTime: article.localDateTime,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   // ✅ FIXED: toast message now references title (not name)
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: Freebirds World Burrito",

[Killed] ObjectLiteral
main/pages/Articles/ArticleEditPage.jsx:32:11
     url: "/api/articles",
     method: "PUT",
     params: { id: article.id },
-    data: {
-      title: article.title,
-      url: article.url,
-      email: article.email,
-      explanation: article.explanation,
-      localDateTime: article.localDateTime,
-    },
+    data: {},
   });
 
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"title":"Freebirds World Burrito","u…' // Object.is equality

[Killed] BlockStatement
main/pages/Articles/ArticleEditPage.jsx:42:34
   });
 
   // ✅ FIXED: toast message now references title (not name)
-  const onSuccess = (article) => {
-    toast(`Article Updated - id: ${article.id} title: ${article.title}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/Articles/ArticleEditPage.jsx:43:11
 
   // ✅ FIXED: toast message now references title (not name)
   const onSuccess = (article) => {
-    toast(`Article Updated - id: ${article.id} title: ${article.title}`);
+    toast(``);
   };
 
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: Freebirds World Burrito",

[Killed] ConditionalExpression
main/pages/Articles/ArticleEditPage.jsx:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={article}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ArticleEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
