[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helprequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helprequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helprequest) => ({});
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `New Help Request Created - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
