[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helprequest) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: helprequest.id,
-    },
-    data: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Help request Updated - id: 17 requesterEmail: kelvinfangedited@ucsb.edu",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(`Help request Updated - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`);
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helprequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helprequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
