[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:10:13
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (menuItemReview) => ({
     url: "/api/menuitemreviews/post",
-    method: "POST",
+    method: "",
     params: {
       itemId: menuItemReview.itemId,
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New menu item review Created - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:35:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const menuItemReview = {
-      itemId: parseInt(data.itemId),
-      reviewerEmail: data.reviewerEmail,
-      stars: parseInt(data.stars),
-      dateReviewed: data.dateReviewed,
-      comments: data.comments,
-    };
-    mutation.mutate(menuItemReview);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
