[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:31
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   // Convert form input into API request params
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post", // ✅ update endpoint as needed
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   // Toast message on success
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:23:48
   });
 
   // Toast message on success
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New RecommendationRequest Created - id: ${recommendationRequest.id}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   // Backend mutation hook
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:25:7
   // Toast message on success
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New RecommendationRequest Created - id: ${recommendationRequest.id}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New RecommendationRequest Created - id: 3",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:40:36
   const { isSuccess } = mutation;
 
   // Handle form submit
-  const onSubmit = async (data) => {
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   // Redirect after success (if not in Storybook)
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:45:20
   };
 
   // Redirect after success (if not in Storybook)
-  if (isSuccess && !storybook) {
+  if (isSuccess && storybook) {
     return <Navigate to="/recommendationrequest" />;
   }
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:45:32
   };
 
   // Redirect after success (if not in Storybook)
-  if (isSuccess && !storybook) {
-    return <Navigate to="/recommendationrequest" />;
-  }
+  if (isSuccess && !storybook) {}
 
   // Render
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0
