[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:46:48
   });
   // Stryker restore all
 
-  const onSuccess = (recommendationRequest) => {
-    // Stryker disable next-line all : hard to test toast message
-    toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:49:7
   const onSuccess = (recommendationRequest) => {
     // Stryker disable next-line all : hard to test toast message
     toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`
+      ``
     );
   };
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: student2@ucsb.edu",

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:75:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {recommendationRequest || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationRequest} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="RecommendationRequestForm-requesterEmail"
  id="requesterEmail"
  name="requesterEmail"
  type="email"

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:75:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
