[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-      dining_commons_code: menuItem.dining_commons_code,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:8:46
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-      dining_commons_code: menuItem.dining_commons_code,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosParams = (menuItem) => ({});
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:18:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(
-      `New menu item Created - id: ${menuItem.id} name: ${menuItem.name}`,
-    );
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
