[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/UCSBDiningCommonsMenuItem?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/UCSBDiningCommonsMenuItem`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem",
-    method: "PUT",
-    params: {
-      id: menuItem.id,
-    },
-    data: {
-      dining_commons_code: menuItem.dining_commons_code,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBDiningCommonsMenuItem Updated - id: 17 name: Turkey Sandwich",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:31:13
   const objectToAxiosPutParams = (menuItem) => ({
     url: "/api/UCSBDiningCommonsMenuItem",
     method: "PUT",
-    params: {
-      id: menuItem.id,
-    },
+    params: {},
     data: {
       dining_commons_code: menuItem.dining_commons_code,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:34:11
     params: {
       id: menuItem.id,
     },
-    data: {
-      dining_commons_code: menuItem.dining_commons_code,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
+    data: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"dining_commons_code":"portola","nam…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:41:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`UCSBDiningCommonsMenuItem Updated - id: ${menuItem.id} name: ${menuItem.name}`);
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:58:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/UCSBDiningCommonsMenuItem" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItem}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
