[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:12:30
 export default function UCSBDiningCommonsMenuItemIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/UCSBDiningCommonsMenuItem/create"
-          style={{ float: "right" }}
-        >
-          Create Menu Item
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/UCSBDiningCommonsMenuItem/create"
-          style={{ float: "right" }}
-        >
-          Create Menu Item
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:18:18
         <Button
           variant="primary"
           href="/UCSBDiningCommonsMenuItem/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Menu Item
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:18:27
         <Button
           variant="primary"
           href="/UCSBDiningCommonsMenuItem/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Menu Item
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ArrayDeclaration
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/UCSBDiningCommonsMenuItem/all"],
     { method: "GET", url: "/api/UCSBDiningCommonsMenuItem/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders empty table when backend unavailable, user only
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"
/> instead
