[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrg.orgCode,
-      orgTranslationShort: ucsbOrg.orgTranslationShort,
-      orgTranslation: ucsbOrg.orgTranslation,
-      inactive: ucsbOrg.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
   const onSuccess = (created) => {
     toast(
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:18:34
       inactive: ucsbOrg.inactive,
     },
   });
-  const onSuccess = (created) => {
-    toast(
-      `New UCSBOrganization Created - id: ${created.id} orgCode: ${created.orgCode}`,
-    );
-  };
+  const onSuccess = (created) => {};
   const mutation = useBackendMutation(
     objectToAxiosParams,
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:20:7
   });
   const onSuccess = (created) => {
     toast(
-      `New UCSBOrganization Created - id: ${created.id} orgCode: ${created.orgCode}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New UCSBOrganization Created - id: 5 orgCode: ZETA",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:30:30
     ["/api/ucsborganizations/all"],
   );
   const { isSuccess } = mutation;
-  const onSubmit = (data) => {
-    mutation.mutate(data);
-  };
+  const onSubmit = (data) => {};
   if (isSuccess && !storybook) {
     return <Navigate to="/ucsborganization" />;
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:33:32
   const onSubmit = (data) => {
     mutation.mutate(data);
   };
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (isSuccess && !storybook) {}
   return (
     <BasicLayout>
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected "spy" to be called with arguments: [ { to: '/ucsborganization' } ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:33:7
   const onSubmit = (data) => {
     mutation.mutate(data);
   };
-  if (isSuccess && !storybook) {
+  if (false) {
     return <Navigate to="/ucsborganization" />;
   }
killedBy: UCSBOrganizationCreatePage tests submit posts to backend and redirects to /ucsborganization
statusReason: expected "spy" to be called with arguments: [ { to: '/ucsborganization' } ]

Number of calls: 0
