[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:9:19
 
 export default function UCSBOrganizationEditPage({ storybook = false }) {
   const { orgCode: orgCodeParam, id: legacyIdParam } = useParams();
-  const orgCode = orgCodeParam ?? legacyIdParam;
+  const orgCode = orgCodeParam && legacyIdParam;
 
   // GET the record by orgCode
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:13:6
 
   // GET the record by orgCode
   const { data: ucsbOrganization } = useBackend(
-    [`/api/ucsborganizations?orgCode=${orgCode}`],
+    [``],
     {
       method: "GET",
killedBy: UCSBOrganizationEditPage verifies correct GET method and invalidation key
statusReason: expected [ '' ] to deeply equal [ Array(1) ]

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:22:34
   );
 
   // PUT update
-  const objectToAxiosPutParams = (form) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: { orgCode },
-    data: {
-      orgTranslationShort: form.orgTranslationShort,
-      orgTranslation: form.orgTranslation,
-      inactive: form.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
   const onSuccess = (updated) => {
     toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:22:45
   );
 
   // PUT update
-  const objectToAxiosPutParams = (form) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: { orgCode },
-    data: {
-      orgTranslationShort: form.orgTranslationShort,
-      orgTranslation: form.orgTranslation,
-      inactive: form.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (form) => ({});
   const onSuccess = (updated) => {
     toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:32:34
       inactive: form.inactive,
     },
   });
-  const onSuccess = (updated) => {
-    toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
-  };
+  const onSuccess = (updated) => {};
 
   const mutation = useBackendMutation(objectToAxiosPutParams, { onSuccess }, [
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:33:50
     },
   });
   const onSuccess = (updated) => {
-    toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
+    toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode && orgCode}`);
   };
 
killedBy: UCSBOrganizationEditPage PUT response missing orgCode → uses fallback toast value
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - orgCode: ZBT",

[Killed] OptionalChaining
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:33:50
     },
   });
   const onSuccess = (updated) => {
-    toast(`UCSBOrganization Updated - orgCode: ${updated?.orgCode ?? orgCode}`);
+    toast(`UCSBOrganization Updated - orgCode: ${updated.orgCode ?? orgCode}`);
   };
 
killedBy: UCSBOrganizationEditPage PUT returns null → handles gracefully and uses route orgCode
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - orgCode: ZBT",

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:40:20
     `/api/ucsborganizations?orgCode=${orgCode}`,
   ]);
 
-  const onSubmit = (data) => mutation.mutate(data);
+  const onSubmit = () => undefined;
   if (!orgCode) {
     toast("Missing route param: orgCode (or id). Check your route path.");
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:41:7
   ]);
 
   const onSubmit = (data) => mutation.mutate(data);
-  if (!orgCode) {
+  if (orgCode) {
     toast("Missing route param: orgCode (or id). Check your route path.");
     return <Navigate to="/ucsborganization" />;
killedBy: UCSBOrganizationEditPage when route param missing → toast + Navigate
statusReason: expected "spy" to be called with arguments: [ StringMatching{…} ]

Received: 

  1st spy call:

  [
-   StringMatching /Missing route param: orgCode/,

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:41:17
   ]);
 
   const onSubmit = (data) => mutation.mutate(data);
-  if (!orgCode) {
-    toast("Missing route param: orgCode (or id). Check your route path.");
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (!orgCode) {}
 
   if (mutation.isSuccess && !storybook) {
killedBy: UCSBOrganizationEditPage when route param missing → toast + Navigate
statusReason: expected "spy" to be called with arguments: [ StringMatching{…} ]

Received: 

  1st spy call:

  [
-   StringMatching /Missing route param: orgCode/,

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:46:41
     return <Navigate to="/ucsborganization" />;
   }
 
-  if (mutation.isSuccess && !storybook) {
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (mutation.isSuccess && !storybook) {}
 
   return (
killedBy: UCSBOrganizationEditPage PUT success → updates and navigates back
statusReason: expected "spy" to be called with arguments: [ { to: '/ucsborganization' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:46:7
     return <Navigate to="/ucsborganization" />;
   }
 
-  if (mutation.isSuccess && !storybook) {
+  if (mutation.isSuccess || !storybook) {
     return <Navigate to="/ucsborganization" />;
   }
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:54:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            initialContents={ucsbOrganization}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {ucsbOrganization || <UCSBOrganizationForm initialContents={ucsbOrganization} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: expect(element).toHaveValue(ZBT)

Expected the element to have value:
  ZBT
Received:

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:54:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            initialContents={ucsbOrganization}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage GET success → shows form with correct initial values
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
