[Killed] ArrayDeclaration
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.jsx:25:7
     ? organizations
     : Array.isArray(organizations?.content)
     ? organizations.content
-    : [];
+    : ["Stryker was here"];
 
   const createButton = () =>
killedBy: UCSBOrganizationIndexPage tests treats null response as empty array and passes [] to table
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.jsx:27:24
     ? organizations.content
     : [];
 
-  const createButton = () =>
-    hasRole(currentUser, "ROLE_ADMIN") ? (
-      <Button
-        variant="primary"
-        href="/ucsborganization/create"
-        style={{ float: "right" }}
-      >
-        Create UCSBOrganization
-      </Button>
-    ) : null;
+  const createButton = () => undefined;
   return (
     <BasicLayout>
killedBy: UCSBOrganizationIndexPage tests renders Create button for admin user (array response)
statusReason: Unable to find role="button" and name "Create UCSBOrganization"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
