[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  const orgCode = cell?.row?.original?.orgCode;
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: { orgCode },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationTable tests axios params builder produces correct DELETE config (extra guard)
statusReason: expected undefined to deeply equal { url: '/api/ucsborganizations', …(2) }

[Killed] OptionalChaining
src/main/utils/UCSBOrganizationUtils.js:9:19
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  const orgCode = cell?.row?.original?.orgCode;
+  const orgCode = cell?.row?.original.orgCode;
   return {
     url: "/api/ucsborganizations",
killedBy: UCSBOrganizationUtils cellToAxiosParamsDelete survives missing nested properties (kills optional chaining mutant)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] OptionalChaining
src/main/utils/UCSBOrganizationUtils.js:9:19
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  const orgCode = cell?.row?.original?.orgCode;
+  const orgCode = cell.row?.original?.orgCode;
   return {
     url: "/api/ucsborganizations",
killedBy: UCSBOrganizationUtils cellToAxiosParamsDelete survives missing nested properties (kills optional chaining mutant)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:13:13
   return {
     url: "/api/ucsborganizations",
     method: "DELETE",
-    params: { orgCode },
+    params: {},
   };
 }
killedBy: UCSBOrganizationTable tests axios params builder produces correct DELETE config (extra guard)
statusReason: expected { url: '/api/ucsborganizations', …(2) } to deeply equal { url: '/api/ucsborganizations', …(2) }
